Repository: Spakeyvr/ChatLLM
Catalog: ChatLLM/Localizable.xcstrings
Source language: en
Languages: de, es

source: %@ Disable forced web search for this response or switch to a supported backend.
de: %@ Deaktiviere die erzwungene Websuche für diese Antwort oder wechsle zu einem unterstützten Backend.
es: %@ Desactiva la búsqueda web obligatoria para esta respuesta o cambia a un motor compatible.

source: %@ is downloading
de: %@ wird heruntergeladen
es: Se está descargando %@

source: %@ is not downloaded. Download it before loading.
de: %@ ist nicht heruntergeladen. Lade es zuerst herunter.
es: %@ no está descargado. Descárgalo antes de cargarlo.

source: %@ requires an iPhone with at least %@ GB of RAM.
de: %@ benötigt ein iPhone mit mindestens %@ GB RAM.
es: %@ requiere un iPhone con al menos %@ GB de RAM.

source: %lld days
de: %lld Tage
es: %lld días

source: %lld objects detected
de: %lld Objekte erkannt
es: %lld objetos detectados

source: %lld points
de: %lld Punkte
es: %lld puntos

source: %lld sources
de: %lld Quellen
es: %lld fuentes

source: A quick tour so new users understand what the app can do.
de: Eine kurze Einführung in die Funktionen der App.
es: Un breve recorrido para conocer lo que puede hacer la app.

source: About & Support
de: Über die App & Support
es: Acerca de y ayuda

source: About RotorQuant
de: Über RotorQuant
es: Acerca de RotorQuant

source: Access to the file was denied.
de: Der Zugriff auf die Datei wurde verweigert.
es: Se ha denegado el acceso al archivo.

source: Add a Tavily API key if you want the assistant to search the web for current information.
de: Füge einen Tavily-API-Schlüssel hinzu, damit der Assistent im Web nach aktuellen Informationen suchen kann.
es: Añade una clave de API de Tavily para que el asistente busque información actual en la web.

source: Add an action beneath assistant messages to view raw output and generation diagnostics.
de: Zeigt unter Antworten eine Aktion für die Rohausgabe und Generierungsdiagnose an.
es: Añade una acción debajo de las respuestas para ver la salida sin procesar y los diagnósticos de generación.

source: Add attachment or web search
de: Anhang oder Websuche hinzufügen
es: Añadir archivo o búsqueda web

source: Add to Chat
de: Zum Chat hinzufügen
es: Añadir al chat

source: Adjusts user and assistant messages. Settings and other controls follow your device’s text size.
de: Passt die Textgröße der Nachrichten an. Einstellungen und andere Bedienelemente verwenden die Textgröße deines Geräts.
es: Ajusta los mensajes del usuario y del asistente. Los ajustes y otros controles usan el tamaño de texto del dispositivo.

source: Advanced
de: Erweitert
es: Avanzado

source: All conversations and their attachments will be permanently deleted. This cannot be undone.
de: Alle Chats und ihre Anhänge werden dauerhaft gelöscht. Dies kann nicht rückgängig gemacht werden.
es: Se eliminarán permanentemente todos los chats y sus archivos adjuntos. Esta acción no se puede deshacer.

source: All conversations except the current one will be permanently deleted. If no chat is selected, the most recent chat is kept. This cannot be undone.
de: Alle Chats außer dem aktuellen werden dauerhaft gelöscht. Ist kein Chat ausgewählt, bleibt der neueste erhalten. Dies kann nicht rückgängig gemacht werden.
es: Se eliminarán permanentemente todos los chats excepto el actual. Si no hay ningún chat seleccionado, se conservará el más reciente. Esta acción no se puede deshacer.

source: Allow models and tool calls that exceed this device’s memory limits. This can cause crashes or severe slowdowns.
de: Erlaubt Modelle und Tool-Aufrufe, die das Speicherlimit dieses Geräts überschreiten. Dies kann zu Abstürzen oder starken Verzögerungen führen.
es: Permite modelos y llamadas a herramientas que superen los límites de memoria del dispositivo. Puede provocar cierres inesperados o una gran lentitud.

source: Already downloaded
de: Bereits heruntergeladen
es: Ya descargado

source: Always Reason
de: Immer nachdenken
es: Razonar siempre

source: An unknown error occurred.
de: Ein unbekannter Fehler ist aufgetreten.
es: Se ha producido un error desconocido.

source: API Key
de: API-Schlüssel
es: Clave de API

source: Appearance
de: Darstellung
es: Apariencia

source: Apple's safety system blocked this response. Try rephrasing your request.
de: Apples Sicherheitssystem hat diese Antwort blockiert. Versuche, deine Anfrage umzuformulieren.
es: El sistema de seguridad de Apple ha bloqueado esta respuesta. Prueba a reformular tu solicitud.

source: Architecture
de: Architektur
es: Arquitectura

source: Ask anything
de: Frag etwas
es: Pregunta lo que quieras

source: Auto-Delete Chats
de: Chats automatisch löschen
es: Eliminar chats automáticamente

source: Automatically remove conversations older than the selected period. Deleted chats cannot be recovered.
de: Löscht Chats automatisch, wenn sie älter als der gewählte Zeitraum sind. Gelöschte Chats können nicht wiederhergestellt werden.
es: Elimina automáticamente los chats anteriores al período seleccionado. Los chats eliminados no se pueden recuperar.

source: Available
de: Verfügbar
es: Disponible

source: Available Models
de: Verfügbare Modelle
es: Modelos disponibles

source: Back
de: Zurück
es: Atrás

source: Camera
de: Kamera
es: Cámara

source: Cancel
de: Abbrechen
es: Cancelar

source: Cancel edit
de: Bearbeitung abbrechen
es: Cancelar edición

source: ChatLLM couldn't open your saved chats. New messages in this session won't be saved. Keep your existing chats to try again on the next launch, or start fresh with an empty history. A backup copy has been kept either way.
de: ChatLLM konnte deine gespeicherten Chats nicht öffnen. Neue Nachrichten in dieser Sitzung werden nicht gespeichert. Behalte deine vorhandenen Chats, um es beim nächsten Start erneut zu versuchen, oder beginne neu mit einem leeren Verlauf. In beiden Fällen wurde eine Sicherungskopie aufbewahrt.
es: ChatLLM no pudo abrir tus chats guardados. Los mensajes nuevos de esta sesión no se guardarán. Conserva tus chats existentes para volver a intentarlo en el próximo inicio, o empieza de cero con un historial vacío. En ambos casos se ha guardado una copia de seguridad.

source: ChatLLM is in beta. Features may change, and you may encounter bugs. Your feedback helps improve the app.
de: ChatLLM ist in der Beta-Phase. Funktionen können sich ändern und Fehler auftreten. Dein Feedback hilft, die App zu verbessern.
es: ChatLLM está en fase beta. Las funciones pueden cambiar y puede haber errores. Tus comentarios ayudan a mejorar la app.

source: Chats Can't Be Saved
de: Chats können nicht gespeichert werden
es: No se pueden guardar los chats

source: Choose a chat from the sidebar to continue
de: Wähle einen Chat in der Seitenleiste, um fortzufahren
es: Elige un chat de la barra lateral para continuar

source: Clear Preferences
de: Vorgaben löschen
es: Borrar preferencias

source: Clear search
de: Suche löschen
es: Borrar búsqueda

source: Close sidebar
de: Seitenleiste schließen
es: Cerrar barra lateral

source: Color Scheme
de: Farbschema
es: Esquema de color

source: Compresses the MLX conversation cache to reduce memory use. This is an early beta; speed and stability may vary.
de: Komprimiert den MLX-Chat-Cache, um den Speicherbedarf zu verringern. Frühe Beta: Geschwindigkeit und Stabilität können variieren.
es: Comprime la caché de conversación de MLX para reducir el uso de memoria. Es una beta inicial; la velocidad y la estabilidad pueden variar.

source: Confidence Threshold
de: Konfidenzschwelle
es: Umbral de confianza

source: Configured
de: Eingerichtet
es: Configurado

source: Connect Tavily to search the web in conversations. Your API key is stored securely in the device’s Keychain.
de: Verbinde Tavily, um in Chats das Web zu durchsuchen. Dein API-Schlüssel wird sicher im Schlüsselbund des Geräts gespeichert.
es: Conecta Tavily para buscar en la web durante los chats. Tu clave de API se guarda de forma segura en el llavero del dispositivo.

source: Context Length
de: Kontextlänge
es: Longitud de contexto

source: Context Window
de: Kontextfenster
es: Ventana de contexto

source: Context window limit reached. This device is currently capped at about %lld tokens for on-device MLX chats. Try one of these solutions: • Start a new chat or trim earlier messages • Lower the Context Window setting • Shorten your system prompt or the latest message
de: Kontextlimit erreicht. MLX-Chats auf diesem Gerät sind derzeit auf etwa %lld Tokens begrenzt. Versuche Folgendes: • Starte einen neuen Chat oder kürze frühere Nachrichten • Verkleinere das Kontextfenster in den Einstellungen • Kürze deine Systemanweisung oder die letzte Nachricht
es: Se ha alcanzado el límite de contexto. Los chats MLX en este dispositivo están limitados a unos %lld tokens. Prueba una de estas opciones: • Inicia un chat nuevo o recorta los mensajes anteriores • Reduce la ventana de contexto en los ajustes • Acorta las instrucciones del sistema o el último mensaje

source: Continue
de: Weiter
es: Continuar

source: Conversation Title
de: Chat-Titel
es: Título del chat

source: Copy
de: Kopieren
es: Copiar

source: Could not construct download URL for file: %@
de: Die Download-URL für die Datei konnte nicht erstellt werden: %@
es: No se ha podido crear la URL de descarga del archivo: %@

source: Could not load the selected image.
de: Das ausgewählte Bild konnte nicht geladen werden.
es: No se ha podido cargar la imagen seleccionada.

source: Couldn't stop the active response. Please try deleting again.
de: Die laufende Antwort konnte nicht gestoppt werden. Versuche erneut, den Chat zu löschen.
es: No se ha podido detener la respuesta en curso. Intenta eliminar el chat de nuevo.

source: Custom
de: Benutzerdefiniert
es: Personalizado

source: Dark
de: Dunkel
es: Oscuro

source: Delete
de: Löschen
es: Eliminar

source: Delete After
de: Löschen nach
es: Eliminar después de

source: Delete All Chats
de: Alle Chats löschen
es: Eliminar todos los chats

source: Delete All Chats?
de: Alle Chats löschen?
es: ¿Eliminar todos los chats?

source: Delete All Except Current
de: Alle außer dem aktuellen löschen
es: Eliminar todos excepto el actual

source: Delete failed: %@
de: Löschen fehlgeschlagen: %@
es: Error al eliminar: %@

source: Delete Model?
de: Modell löschen?
es: ¿Eliminar modelo?

source: Delete Other Chats?
de: Andere Chats löschen?
es: ¿Eliminar los demás chats?

source: Description
de: Beschreibung
es: Descripción

source: Developer
de: Entwickler
es: Desarrollador

source: Directory
de: Verzeichnis
es: Directorio

source: Disable
de: Deaktivieren
es: Desactivar

source: Disable RAM Precautions
de: RAM-Schutz deaktivieren
es: Desactivar protección de RAM

source: Disable RAM Precautions?
de: RAM-Schutz deaktivieren?
es: ¿Desactivar la protección de RAM?

source: Disable Tool Calls
de: Tool-Aufrufe deaktivieren
es: Desactivar llamadas a herramientas

source: Discourage repeated words and phrases. Increase gradually if a model loops or echoes itself.
de: Verringert wiederholte Wörter und Sätze. Erhöhe den Wert schrittweise, wenn sich ein Modell ständig wiederholt.
es: Reduce las palabras y frases repetidas. Aumenta el valor poco a poco si el modelo se repite o entra en bucle.

source: Done
de: Fertig
es: Listo

source: Download (%@)
de: Herunterladen (%@)
es: Descargar (%@)

source: Download %@
de: %@ herunterladen
es: Descargar %@

source: Download an MLX model if you want
de: Optional: MLX-Modell herunterladen
es: Descarga un modelo MLX si quieres

source: Downloaded file '%@' failed its integrity check. Try downloading the model again.
de: Die heruntergeladene Datei „%@“ hat die Integritätsprüfung nicht bestanden. Lade das Modell erneut herunter.
es: El archivo descargado «%@» no superó la comprobación de integridad. Vuelve a descargar el modelo.

source: Downloaded file '%@' has the wrong size (expected %lld bytes, received %lld bytes).
de: Die heruntergeladene Datei „%@“ hat die falsche Größe (%lld Bytes erwartet, %lld Bytes erhalten).
es: El archivo descargado «%@» tiene un tamaño incorrecto (se esperaban %lld bytes y se han recibido %lld bytes).

source: Downloaded model is incomplete. Missing config.json or safetensors weights.
de: Das heruntergeladene Modell ist unvollständig. config.json oder safetensors-Gewichte fehlen.
es: El modelo descargado está incompleto. Falta config.json o los pesos safetensors.

source: Downloading %@
de: %@ wird heruntergeladen
es: Descargando %@

source: Downloading %lld%%
de: Download: %lld%%
es: Descargando: %lld%%

source: Duration
de: Dauer
es: Duración

source: Edit
de: Bearbeiten
es: Editar

source: Email Support
de: Support per E-Mail
es: Ayuda por correo

source: Enabled by default for persistent MLX text and image chats, RotorQuant uses IsoQuant block rotations with 3-bit keys, 2-bit values, exact prefill buffering, and per-layer deterministic rotation parameters to reduce memory use. Tool and low-memory turns use safer uncompressed or bounded caches.
de: RotorQuant ist standardmäßig für persistente MLX-Text- und Bildchats aktiviert. Es nutzt IsoQuant-Blockrotationen mit 3-Bit-Schlüsseln, 2-Bit-Werten, exakter Prefill-Pufferung und deterministischen Rotationsparametern pro Schicht, um den Speicherbedarf zu verringern. Bei Tool-Aufrufen und wenig Arbeitsspeicher werden sicherere unkomprimierte oder begrenzte Caches verwendet.
es: RotorQuant está activado por defecto en los chats persistentes de texto e imagen de MLX. Usa rotaciones de bloques IsoQuant con claves de 3 bits, valores de 2 bits, almacenamiento exacto del prefill y parámetros de rotación deterministas por capa para reducir el uso de memoria. Los turnos con herramientas o poca memoria usan cachés más seguras, sin comprimir o con límites.

source: Enabled by default for supported persistent MLX text and image chats. Tool and low-memory turns use safer cache modes.
de: Standardmäßig für unterstützte persistente MLX-Text- und Bildchats aktiviert. Bei Tool-Aufrufen und wenig Arbeitsspeicher werden sicherere Cache-Modi verwendet.
es: Activado por defecto en los chats persistentes de texto e imagen de MLX compatibles. Los turnos con herramientas o poca memoria usan modos de caché más seguros.

source: Enter a new name for this conversation
de: Gib einen neuen Namen für diesen Chat ein
es: Introduce un nombre nuevo para este chat

source: Enter a search query under 400 characters.
de: Gib eine Suchanfrage mit weniger als 400 Zeichen ein.
es: Introduce una consulta de menos de 400 caracteres.

source: Enter your Tavily API key
de: Tavily-API-Schlüssel eingeben
es: Introduce tu clave de API de Tavily

source: Error
de: Fehler

source: Est. output tokens
de: Geschätzte Ausgabetokens
es: Tokens de salida estimados

source: Est. tokens/sec
de: Geschätzte Tokens/Sek.
es: Tokens/s estimados

source: Experimental
de: Experimentell

source: Export a copy of your conversations to keep or share.
de: Exportiere eine Kopie deiner Chats zum Aufbewahren oder Teilen.
es: Exporta una copia de tus chats para guardarla o compartirla.

source: Export All Chats
de: Alle Chats exportieren
es: Exportar todos los chats

source: Failed to delete all conversations. Please try again.
de: Die Chats konnten nicht alle gelöscht werden. Versuche es erneut.
es: No se han podido eliminar todos los chats. Inténtalo de nuevo.

source: Failed to delete conversation. Please try again.
de: Der Chat konnte nicht gelöscht werden. Versuche es erneut.
es: No se ha podido eliminar el chat. Inténtalo de nuevo.

source: Failed to delete conversations. Please try again.
de: Die Chats konnten nicht gelöscht werden. Versuche es erneut.
es: No se han podido eliminar los chats. Inténtalo de nuevo.

source: Failed to export chats. Please try again.
de: Die Chats konnten nicht exportiert werden. Versuche es erneut.
es: No se han podido exportar los chats. Inténtalo de nuevo.

source: Failed to extract text from the image.
de: Der Text konnte nicht aus dem Bild gelesen werden.
es: No se ha podido extraer el texto de la imagen.

source: Failed to load model: %@
de: Modell konnte nicht geladen werden: %@
es: No se ha podido cargar el modelo: %@

source: Failed to prepare image for native inference: %@
de: Bild konnte nicht für die native Inferenz vorbereitet werden: %@
es: No se ha podido preparar la imagen para la inferencia nativa: %@

source: Failed to rename conversation. Please try again.
de: Der Chat konnte nicht umbenannt werden. Versuche es erneut.
es: No se ha podido cambiar el nombre del chat. Inténtalo de nuevo.

source: File Import Failed
de: Dateiimport fehlgeschlagen
es: Error al importar el archivo

source: Files
de: Dateien
es: Archivos

source: Fine-tune local models and diagnostics. The defaults are recommended for most people.
de: Passe lokale Modelle und Diagnosen an. Für die meisten Nutzer werden die Standardeinstellungen empfohlen.
es: Ajusta los modelos locales y los diagnósticos. Se recomiendan los valores predeterminados para la mayoría de los usuarios.

source: Finish
de: Abschließen
es: Finalizar

source: Finished
de: Abgeschlossen
es: Finalizado

source: For example: Keep answers concise, use metric units, and explain technical terms. Applies to new chats only.
de: Zum Beispiel: Antworte knapp, verwende metrische Einheiten und erkläre Fachbegriffe. Gilt nur für neue Chats.
es: Por ejemplo: Responde de forma breve, usa unidades métricas y explica los términos técnicos. Solo se aplica a los chats nuevos.

source: Full multimodal package
de: Vollständiges multimodales Paket
es: Paquete multimodal completo

source: Generation timed out after %lld seconds.
de: Die Generierung wurde nach %lld Sekunden wegen Zeitüberschreitung abgebrochen.
es: Se ha agotado el tiempo de generación tras %lld segundos.

source: Get a Tavily API key
de: Tavily-API-Schlüssel erhalten
es: Obtener una clave de API de Tavily

source: Get help, report a problem, or share an idea for ChatLLM.
de: Erhalte Hilfe, melde ein Problem oder teile eine Idee für ChatLLM.
es: Obtén ayuda, informa de un problema o comparte una idea para ChatLLM.

source: Get or Manage API Key
de: API-Schlüssel erhalten oder verwalten
es: Obtener o gestionar clave de API

source: Haptic Feedback
de: Haptisches Feedback
es: Respuesta háptica

source: Higher confidence reduces false detections but may miss objects. Used only by the Apple Vision fallback when the selected model cannot analyze images directly.
de: Eine höhere Konfidenz verringert Fehlerkennungen, kann aber Objekte übersehen. Gilt nur für Apple Vision als Ersatz, wenn das gewählte Modell Bilder nicht direkt analysieren kann.
es: Un valor de confianza mayor reduce las detecciones erróneas, pero puede omitir objetos. Solo se usa con Apple Vision cuando el modelo seleccionado no puede analizar imágenes directamente.

source: How can I make my day a little simpler?
de: Wie kann ich meinen Tag etwas einfacher machen?
es: ¿Cómo puedo hacer mi día un poco más sencillo?

source: How It Works
de: So funktioniert’s
es: Cómo funciona

source: How much conversation a local MLX model can use. This device supports up to %lld tokens.
de: Wie viel des Chatverlaufs ein lokales MLX-Modell verwenden kann. Dieses Gerät unterstützt bis zu %lld Tokens.
es: Cuánto historial puede usar un modelo MLX local. Este dispositivo admite hasta %lld tokens.

source: How should the assistant respond?
de: Wie soll der Assistent antworten?
es: ¿Cómo debe responder el asistente?

source: Image Analysis
de: Bildanalyse
es: Análisis de imágenes

source: Image attached
de: Bild angehängt
es: Imagen adjunta

source: Image has invalid dimensions or scale
de: Das Bild hat ungültige Abmessungen oder eine ungültige Skalierung
es: La imagen tiene dimensiones o una escala no válidas

source: Image has no bitmap data
de: Das Bild enthält keine Bitmap-Daten
es: La imagen no contiene datos de mapa de bits

source: Image unavailable
de: Bild nicht verfügbar
es: Imagen no disponible

source: Installed model '%@' is incompatible with native image support (processor '%@'). Re-download %@ to get the correct multimodal files.
de: Das installierte Modell „%@“ unterstützt keine nativen Bilder (Prozessor „%@“). Lade %@ erneut herunter, um die richtigen multimodalen Dateien zu erhalten.
es: El modelo instalado «%@» no es compatible con imágenes nativas (procesador «%@»). Vuelve a descargar %@ para obtener los archivos multimodales correctos.

source: Installed model '%@' is missing processor metadata for native image support. Re-download %@ to enable native images.
de: Dem installierten Modell „%@“ fehlen Prozessor-Metadaten für native Bildunterstützung. Lade %@ erneut herunter, um Bilder direkt zu verarbeiten.
es: Al modelo instalado «%@» le faltan los metadatos del procesador para la compatibilidad nativa con imágenes. Vuelve a descargar %@ para activarla.

source: Interaction
de: Interaktion
es: Interacción

source: Invalid server response
de: Ungültige Serverantwort
es: Respuesta del servidor no válida

source: Join Discord Community
de: Discord-Community beitreten
es: Unirse a la comunidad de Discord

source: JPEG encoding failed
de: JPEG-Kodierung fehlgeschlagen
es: Error al codificar en JPEG

source: Keep Existing Chats
de: Vorhandene Chats behalten
es: Conservar los chats existentes

source: Key is valid
de: Schlüssel ist gültig
es: La clave es válida

source: Language
de: Sprache
es: Idioma

source: Language Models
de: Sprachmodelle
es: Modelos de lenguaje

source: Last 7 Days
de: Letzte 7 Tage
es: Últimos 7 días

source: Last 30 Days
de: Letzte 30 Tage
es: Últimos 30 días

source: Light
de: Hell
es: Claro

source: LiquidAI LFM2.5 2.6B text model with always-on reasoning and tool calling.
de: LiquidAI LFM2.5 2.6B-Textmodell mit dauerhaft aktiviertem Denkmodus und Tool-Aufrufen.
es: Modelo de texto LiquidAI LFM2.5 2.6B con razonamiento siempre activo y llamadas a herramientas.

source: Loading
de: Wird geladen
es: Cargando

source: Loading...
de: Wird geladen…
es: Cargando…

source: Loading…
de: Wird geladen…
es: Cargando…

source: Local Models
de: Lokale Modelle
es: Modelos locales

source: Manage Models
de: Modelle verwalten
es: Gestionar modelos

source: Maximum Output
de: Maximale Ausgabe
es: Salida máxima

source: Message composer
de: Nachrichteneingabe
es: Editor de mensajes

source: Message Preview
de: Nachrichtenvorschau
es: Vista previa de mensajes

source: Message Text Size
de: Nachrichtentextgröße
es: Tamaño del texto de mensajes

source: MLX model is installed.
de: MLX-Modell ist installiert.
es: El modelo MLX está instalado.

source: Model
de: Modell
es: Modelo

source: Model '%@' not found in Documents/Models/. Use the Download button to fetch it.
de: Modell „%@“ wurde nicht in Documents/Models/ gefunden. Lade es über die Schaltfläche Herunterladen herunter.
es: No se ha encontrado el modelo «%@» en Documents/Models/. Usa el botón Descargar para obtenerlo.

source: Model Error
de: Modellfehler
es: Error del modelo

source: Model ID
de: Modell-ID
es: ID del modelo

source: Model Information
de: Modellinformationen
es: Información del modelo

source: Models that need more memory than your device has can crash the app or make it extremely slow. Only disable these safeguards if you understand the risks.
de: Modelle, die mehr Arbeitsspeicher benötigen als dein Gerät hat, können die App zum Absturz bringen oder stark verlangsamen. Deaktiviere diesen Schutz nur, wenn du die Risiken verstehst.
es: Los modelos que necesitan más memoria de la disponible pueden cerrar la app inesperadamente o ralentizarla mucho. Desactiva esta protección solo si comprendes los riesgos.

source: More concise
de: Kürzer
es: Más breve

source: More formal
de: Formeller
es: Más formal

source: New Chat
de: Neuer Chat
es: Nuevo chat

source: New Chats
de: Neue Chats
es: Chats nuevos
